Revit 2027 API
BuiltInFailures.SpanDirectionSymbolFailures Class
 Failures about SpanDirectionSymbol.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SpanDirectionSymbolFailures
Public NotInheritable Class SpanDirectionSymbolFailures
public ref class SpanDirectionSymbolFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SpanDirectionSymbolFailures = class end
The BuiltInFailures.SpanDirectionSymbolFailures type exposes the following members.
Properties
Name | Description
NonPlanView |  Span Direction Symbol can only be placed in a Floor Plan View.
Top
See Also
Reference
Autodesk.Revit.DB Namespace